print("body")

print("bo\ndy")
# /n
# بتخلي الكلمه تظهر علي سطرين اكنك دست إنتر

print("\"body\"")
# \"
# عشان تستعمل كوت فالنص العادي من غير ما يحصل إيرور
# بمعني إن الحرف اللي بيجي بعدها المحرر بيتجاهله 

print("bo\tdy")
# \t
# بتخلي في تااب أكن في أربعه سبايس

text = "body"
print(text)
# ممكن تطبع السترينج عادي

# ممكن تعمل  concatenation
# زي كده
print(text+"is my best friend")
# وكده ضفت متغير لنص وهيظهروا جنب بعض

print(text.lower())
# .lower() بتخلي كل الكلمه سمول

print(text.upper())
# .upper() بتخلي كل الحروف كابتل

print(text.isupper())
# .isupper بتشوف لو النص كله كابتل وتديك قيمه بصح أو غلط

print(text.islower())
# .islower بتشوف لو النص كله سمول  وتديك قيمه بصح أو غلط

print(len(text))
# بيديك قيمه بعدد حروف الكلمه أو الكلمه اللي متخزنه في المتغير

print(text[0])
# هيجبلك أول حرف فالكلمه لأن الترقييم فالبرمجه بيبدأ من الصفر

print(text.index("o"))
# هيديك رقم الحرف اللي إنت كتبته وترتيبه فالكلمه اللي متخزنه فالمتغير
print("ali".index("i"))
# زييه برده

print(text.replace("bo", "3o"))
# بياخد إتنين باراميتير أول قيمه اللي هتشيلها والتانيه اللي هتحطها

print(int("5")+int("5"))
# int()
# لتحويل السترينج لرقم صحيح ومبتشتغلش مع العشري

print(float("5.5")+float(6.5))
# ديه بتشتغل مع العشري


# عشان تحول رقم لسترينج
string = str(5)
print("my favourite number is " + string)
# _________________________________________
len("ali ")
# عدد الحروف اللي جوه الكلمه وبيشتغل مع اللست
# لما تطبع لازم تكتب جوه البرينت إما كله أرقام بينهم علامات

# أو لو أكتر من نص زي متغير نص جنبه نص ممكن عن طريق الكومه لو الكلمه فالأول أو عن طريق الزائد
a = "ali"

print(a + " is my friend")
print(a, " is my friend")
# لو عايز تطبع رقم مع إسم

print(1, "is my favourite number")
