from math import *
print(2)
#  تقدر تكتب رقم من غير كوتس وممكن عشري أو سالب حتي

print(2+2)
# تقدر تجمع رقمين

print(5-3)
# تقدر تطرح رقمين

print(2*5)
# تقدر تضرب رقمين

print(5/5)
# تقدر تقسم رقمين

print(5 % 5)
# بتطلعلك خارج القسمه أو اللي فاضل من القسمه واللي هو صفر هنا

print(5 % 2)
# هنا باقي القسمه واحد

# المحرر بيلتزم بقواعد الرياضه فالعمليات وترتيبها
print(3+5*2)
print((3+5)*2)

My_Num = 3
print(My_Num)
# ممكن تخزنه فمتغير عادي

print(str(My_Num))
# str(variable)
# بيحول الرقم لسترينج لأنك مينفعش تطبع رقم مع سترينج

print(abs(My_Num))
# بيديك القيمه المطلقه للعدد

print(pow(2, 3))
# pow(num , num )يعني الرقم الأول أس الرقم التاني

print(max(1, 3, 4, 5))
# بياخد أكبر رقم وبيطبعه

print(min(2, 4, 5, 1, 3))
# بياخد أصغر رقم وبيطبعه

print(round(4.6))
# بتقرب العدد لأقرب عدد صحيح بقواعد الرياضه

# from math import *  شوية فانكشنز من مودييول رياضايات

print(floor(2.7))
# بيجعه للرقم الأقل وخلاص مش تقريب

print(ceil(2.3))
# بيطلعه للرقم الأكبر علي طول مش بيقرب

print(sqrt(9))
# الجذر التربيعي للعدد

print(int("5")+int("5"))
# int()
#  لتحويل السترينج لرقم صحيح ومبتشتغلش مع العشري


print(float("5.5")+float(6.5))
# ديه بتشتغل مع العشري

# عشان تحول رقم لسترينج
string = str(5)
print("my favourite number is " + string)
